InformationRegisters/НастройкаПараметровУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НастройкаПараметровУчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НоменклатураМаксимальноСокращатьНаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БелыйСписокНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>БелыйСписокНоменклатурыУчетКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧерныйСписокНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧерныйСписокНоменклатурыУчетКоличества</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОрганизацииИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениУчетРабочихСмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетРабочегоВремениКоэффициентОкругленияПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестаХраненияИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииКонтрагентовИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииДокументовИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорииНоменклатурыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КассовыеДатыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияСтраныМираИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактнаяИнформацияГородаИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АналитическиеГруппыИспользовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалОпросаВременныхПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимыНастройкиРабочихЦентров</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыНастройкиРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНастройкиРабочихЦентровНоменклатурныеГруппы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимНастройкиРабочихЦентровНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкаПараметровУчета/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьДоступность()
	
	// Элементы.
	Элементы.БелыйСписокНоменклатурыУчетКоличества.Доступность = Запись.БелыйСписокНоменклатурыИспользовать;
	Элементы.ЧерныйСписокНоменклатурыУчетКоличества.Доступность = Запись.ЧерныйСписокНоменклатурыИспользовать;
	
КонецПроцедуры // УстановитьВидимость()


&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	// Зависимые значения.
	Запись.БелыйСписокНоменклатурыУчетКоличества = Запись.БелыйСписокНоменклатурыУчетКоличества И Запись.БелыйСписокНоменклатурыИспользовать;
	Запись.ЧерныйСписокНоменклатурыУчетКоличества = Запись.ЧерныйСписокНоменклатурыУчетКоличества И Запись.ЧерныйСписокНоменклатурыИспользовать;
	
	// Настройка формы.
	УстановитьДоступность();
	
КонецПроцедуры // ПриИзменении()


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подмена объекта формы.
	ЗаписьНастроек = РегистрыСведений.НастройкаПараметровУчета.СоздатьМенеджерЗаписи();	
	ЗаписьНастроек.Прочитать();
	Если ЗаписьНастроек.Выбран() Тогда
		ЗначениеВДанныеФормы(ЗаписьНастроек, Запись);
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Модальный режим.
	Если Не МодальныйРежим Тогда
		ОткрытьФормуМодально("РегистрСведений.НастройкаПараметровУчета.ФормаЗаписи");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Настройка формы.
	УстановитьВидимость(); //Костенюк Александр 12.04.2016
	УстановитьДоступность();
	
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	// Признак приостановки сервера печати.
	ЗаписьНастроек = РегистрыСведений.НастройкаПараметровУчета.СоздатьМенеджерЗаписи();	

	// Удаление записи.
	Если Не Отказ Тогда
		ЗаписьНастроек.Удалить();
	КонецЕсли;

КонецПроцедуры // ПередЗаписьюНаСервере()

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Сброс повторно используемых значений.
	ОбновитьПовторноИспользуемыеЗначения();	
	
	// Обновление интерфейса.
	ОбновитьИнтерфейс();
	
КонецПроцедуры // ПослеЗаписи()

//Костенюк Александр-Старт 12.04.2016
&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ГруппаУчетРабочегоВремени.Видимость = Запись.УчетРабочегоВремениИспользовать;
	
КонецПроцедуры // УстановитьВидимость()
//Костенюк Александр-Финиш 12.04.2016

//Костенюк Александр-Старт 12.04.2016
&НаКлиенте
Процедура ОрганизацииУчетРабочегоВремениИспользоватьПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры
//Костенюк Александр-Финиш 12.04.2016
